# villager와 special npc를 합칩니다.

## 목표

- [ ] villager 필드 정리하고 special npc 합치기
- [ ] tier, ranking 합치기

In [57]:
import numpy as np
import pandas as pd

In [58]:
chars = pd.read_excel('./datasets/villagers.xlsx')
npcs = pd.read_excel('./datasets/special npcs.xlsx')
pops = pd.read_excel('./datasets/popularity.xlsx')
trans = pd.read_csv('./datasets/koname.txt', delimiter='\t')

In [59]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 463 entries, 0 to 462
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      463 non-null    object
 1   en      463 non-null    object
 2   ko      463 non-null    object
dtypes: object(3)
memory usage: 11.0+ KB

생각해보니 번역 파일에 빠진게 있으니 하는김에 채워넣어야 할 것 같습니다.

In [60]:
trans.drop('id', axis=1, inplace=True)
trans.head()

       en       ko
0   Cyrus       리포
1  Copper      경찰관
2  Wilbur      로드리
3   DJ KK  DJ K.K.
4  Booker      경찰관

In [61]:
missing = {
    'Shino': '요비',
    'Sasha': '미첼',
    'Ione': '스피카',
    'Cephalobot': '기가',
    'Tiansheng': '제천',
    'Petri': '리카',
    'Quinn': '시온',
    'Marlo': '보스터',
    'Azalea': '페튜니아',
    'Faith': '마치',
    'Chabwick': '펭구',
    'WartJr': '샘',
    'Rio': '데자네',
    'Buck(Brows)': '바야시코프',
    'Renee': '뿔님이',
    'Roswell': '삐로코',
    'Zoe': '소면',
    'OHare': '산토스',
    'Crackle(Spork)': '포크',
    'Ace': '페더',
    'Frett': '샹펜',
}

en, ko = zip(*missing.items())
# print(en, ko)
amend = pd.DataFrame({'en': en, 'ko': ko})
# amend.head()

trans = pd.concat([trans, amend], axis=0)
trans.reset_index()

     index              en       ko
0        0           Cyrus       리포
1        1          Copper      경찰관
2        2          Wilbur      로드리
3        3           DJ KK  DJ K.K.
4        4          Booker      경찰관
..     ...             ...      ...
479     16             Zoe       소면
480     17           OHare      산토스
481     18  Crackle(Spork)       포크
482     19             Ace       페더
483     20           Frett       샹펜

[484 rows x 3 columns]

In [62]:
trans.reset_index(inplace=True)

In [63]:
trans = trans.sort_values('en').reset_index()
trans.head()

   level_0  index       en    ko
0       64     64      ???   ???
1      482     19      Ace    페더
2      151    151  Admiral    일섭
3      415    415  Agent S    2호
4       83     83    Agnes  아그네스

In [64]:
trans.drop(['level_0', 'index'], axis=1, inplace=True)
trans.head()

        en    ko
0      ???   ???
1      Ace    페더
2  Admiral    일섭
3  Agent S    2호
4    Agnes  아그네스

In [65]:
trans.to_excel('./datasets/trans.xlsx')